Revit 2024 API
AdaptiveComponentInstanceUtils.IsAdaptiveFamilySymbol Method
 Verifies if a FamilySymbol is a valid Adaptive Family Symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool IsAdaptiveFamilySymbol(
	FamilySymbol famSymb
)
Visual Basic
Public Shared Function IsAdaptiveFamilySymbol ( _
	famSymb As FamilySymbol _
) As Boolean
Visual C++
public:
static bool IsAdaptiveFamilySymbol(
	FamilySymbol^ famSymb
)
Parameters
famSymb
Type: Autodesk.Revit.DB.FamilySymbol
 The FamilySymbol
Return Value
 True if the FamilySymbol is a valid Adaptive Family Symbol.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace